// -------------------------------------------------------------------------------
// 
// 		?c?w?ÅÒ?C?u?ÅÒ??		WindowsOS?pBaseImage?v???O?ÅÒ???w?b?_?t?@?C??
// 
// 				Ver 3.24f
// 
// -------------------------------------------------------------------------------

#ifndef DX_BASEIMAGEWIN_H
#define DX_BASEIMAGEWIN_H

// ?C?Åg?N???[?h ------------------------------------------------------------------
#include "../DxCompileConfig.h"
#include <DxLib.h>
#include "DxDirectX.h"

#ifndef DX_NON_NAMESPACE

namespace DxLib
{

#endif // DX_NON_NAMESPACE

// ?}?N??Åf??` --------------------------------------------------------------------

// ?\Åe?Åe?Åf??` --------------------------------------------------------------------

// Åg??ÅhÅe??????Åh???? --------------------------------------------------------------

// ???Åh?v???g?^?C?v????-----------------------------------------------------------

#ifndef DX_NON_NAMESPACE

}

#endif // DX_NON_NAMESPACE

#endif // DX_BASEIMAGEWIN_H
